---
kind: property
id: P:Autodesk.Revit.DB.Definition.Name
source: html/a8f22807-7fef-f24e-e1fa-7dbef20c3628.htm
---
# Autodesk.Revit.DB.Definition.Name Property

The user visible name for the parameter.

## Syntax (C#)
```csharp
public abstract string Name { get; }
```